// 모든 기능은 함수로 구현
// 한 페이지안에 해당 기능이 여러개있을 수 있고 서로 영향을 주지 않음
// 1. PC GNB
//     1depth에 마우스를 올렸을때 하위 메뉴 slide down, 떼면 slide up
//     탭키로 동작 사용 가능
// 2. Mobile GNB
//     GNB 버튼을 눌렀을때 오른쪽에서 왼쪽으로 slide되며 나옴
//     GNB 영역 넓이는 80%, 나머지는 딤처리
//     닫기버튼, 딤영역 클릭 시 메뉴 닫힘
//     메뉴가 열려있을 때 바닥페이지 스크롤 안됨

// 3. 탭
//     탭 클릭 시 하위 컨텐츠 전환
// 4. 아코디언
//     아코디언 클릭 시 내용 열림(slide down), 다른 아코디언은 닫힘(slide up)
//     내용 열고 닫힘에 따라 화살표 아래위로 전환(화살표가 회전하면서 전환됨)
//     아코디언이 열리면 해당 라인의 타이틀이 화면 최상단으로 이동
// 5. 슬라이드
//     좌, 우 화살표
//     하단 인디게이터
//     해당 슬라이드가 몇번째인지 표시(ex. 2/4)
//     첫번째 슬라이드에서는 이전버튼 opacity 흐리게, 마지막슬라이드는 다음버튼 opacity 흐리게
// 6. 툴팁

//     ? 버튼을 눌렀을 때 툴팁이 열림(기본 위치 : 버튼 하단, left 0)
//     닫기 버튼을 누르면 닫힘
//     툴팁이 화면에 가려지지 않도록 위치 조정(버튼이 화면 오른쪽에 있거나 하단에 있을 경우)
// 7. 검색
//     인풋에 텍스트 입력 시 X버튼 노출, 텍스트 없을 경우 X버튼 숨김
//     X버튼 클릭 시 입력값 초기화
// 8. 소팅 테이블
//     1행은 th이고 나머지 행은 td
//     th의 1열은 순서(번호), 나머지는 알아서 구성(이름, 성별, 주소, 나이 등등)
//     td의 내용은 배열(1열의 순서는 자동으로 뿌려질때 같이 부여됨)로 되어있어 초기 로드 시 자동으로 뿌려짐
//     th에 텍스트는 버튼, 클릭 시 오름차순, 또 클릭 시 내림차순, 또 클릭 시 초기값으로
// 9. 탭 type2
//     탭과 컨텐츠로 구성
//     컨텐츠는 초기부터 전체 노출된 상태
//     탭 클릭 시 해당하는 컨텐츠 상단으로 0.3초 동안 이동
//     화면을 올리거나 내릴경우 노출되는 컨텐츠에 따라 알맞은 탭이 on되어야함(bold나 밑줄 등)
// 10. 이미지 레이지로딩
//     초기 로딩속도를 빠르게 하기 위해 화면에 노출되는 부분만 로드되고, 나머지 부분은 스크롤을 해서 해당 영역에 왔을 때 로드됨
//     이미지만 lazy loding를 적용
//     화면 진입시 보여지는 화면 이외에는 이미지경로가 data-src로 되어있다가 해당영역으로 스크롤될때 src로 변경하여 로드시킴
//     새로고침하여 페이지 중간에서 화면이 시작될 경우 위에있는 이미지도 lazy loding 적용
// 11. 드롭다운 메뉴
//     select와 동일한 기능
//     클릭 시 옵션박스 열림, 다시 클릭 시 옵션박스 닫힘
//     옵션 선택 시 옵션박스가 닫히고 선택된 옵션으로 텍스트가 바뀜
//     하위 옵션박스가 열려있을 때 옵션영역 이외의 영역을 클릭 시 옵션박스 닫힘
// 12. 자주찾는 메뉴
//     바닥페이지에는 6개의 버튼 리스트와 변경버튼으로 구성
//     변경버튼을 누르면 레이어팝업 열기
//     레이어팝업 안에는 12개의 리스트가 있는데 체크박스로 되어있고, 팝업 하단에는 취소, 저장 버튼이 위치
//     체크박스는 최대 6개까지 선택 가능하고, 그 이상으로 선택 시 alert창이 뜨고 선택이 안됨
//     취소를 누르면 팝업내용이 초기화된 상태로 팝업이 닫히고, 저장을 누르면 팝업이 닫히고 선택된 버튼들이 바닥페이지 리스트에 반영이됨
// 13. 8번항목 응용
//     테이블 상단에 인풋(뿌려지는 배열 개수와 같게), 추가, 제거버튼이 있음
//     td 1열은 체크박스
//     인풋에 값을 입력하고 추가버튼을 누르면 테이블 하단에 추가됨(번호 자동부여는 동일, 내용이 비어있을 경우 alert가 뜨고 추가되지않음)
//     새로운 리스트가 추가된 후 th에 있는 버튼을 눌렀을때 추가된 리스트도 소팅이 되어야함
//     td에 있는 체크박스를 선택하고 제거버튼을 누르면 해당 행 삭제
// 14. 토스트알림
//     화면에 버튼 6개(텍스트 다르게)
//     버튼 클릭 시 화면 상단에 알림창이 뜸(width: 100px, height: 30px; margin-top: 10px; background: #ddd; border-radius: 100%;)
//     알림창은 0.3초간 생성되고 3초 유지, 0.3초간 사라짐
//     최대 생성개수는 5개, 그 이상이 되면 먼저 뜬 알림창부터 사라짐